In [27]:
from libraries.utility import Utility as mutil
from libraries.db_base import db_base
from libraries.db_ins_fake_data import fake_data_to_db
import pandas as pd
import pandasql as psql

In [28]:
dbprod = db_base("products")

Database : products, Connection Good: True

In [29]:
prod_info = dbprod.run_query_with_single_df(query_key="get_product_info")
prod_info.head(3)

,id,product_name,product_type
0,1,Nicholas's Patriotic Duty,Pay TV ...
1,2,Danielle's Date in the City,Pay TV ...
2,3,Haley's Big Romance,Pay TV ...

In [30]:
dbfin = db_base("finance",svr_type='postsql')

Database : finance, Connection Good: True

In [31]:
fin_account_activity = dbfin.run_query_with_single_df(query_key="get_account_activity")
fin_account_activity.head(3)

,id,product_id,customer_id,account_id,amt_usd,channel_desc,partner_desc,location_name,account_name,account_type
0,1,5,1,777,$33.38,Streaming Subscription ...,Hopkins-Campbell ...,Houston,Sell-Through Income Revenue 246506,Revenue
1,2,277,1,411,$6.62,Home Video Rentals ...,Fernandez PLC ...,Houston,Interest Income Revenue 650062,Revenue
2,3,351,2,355,$23.12,Music Publishing ...,"Mooney, Gomez and Frederick ...",Houston,Rental Income Revenue 677744,Revenue

In [32]:
dbcust = db_base("customers",svr_type='mysql')

Database : customers, Connection Good: True

In [33]:
cust_products = dbcust.run_query_with_single_df(query_key="get_customer_product_history1")
cust_products.head(3)

,id,f_name,l_name,product_id,purchase_dt,expiration_dt,created_dt
0,1,Craig,Smith,130,2023-09-25 10:44:30,2023-11-24 12:53:05,2023-11-08 04:48:06
1,1,Craig,Smith,5,2023-07-01 09:39:52,2023-09-14 23:14:29,2023-11-08 04:48:06
2,1,Craig,Smith,5,2023-06-30 23:14:29,2023-07-01 09:39:52,2023-11-08 04:48:06